
# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = 1
b = 3
print(a + b)
print(a - b)
print(a * b)

