
# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

edge = 3
square = 6 * edge**2
volume = edge**3

print(square)
print(volume)