
# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

a = 4
b = 6

average = (a + b)/2
geometric_mean = (a * b)**0.5
print(average)
print(geometric_mean)