
# Даны действительные числа x и y. Получить (1+ |xy|)/(|x| − |y|)

x = -10
y = 5
if x < 0:
    x = -x

if y < 0:
    y = -y

z = (1 + x * y)/(x - y)
print(z)
