#  Ввести строку. Вывести на экран букву, которая находится в середине этой
# строки.
# Также, если эта центральная буква равна первой букве в строке, то создать и
# вывести часть строки между первым и последним символами исходной строки.
# (подсказка: для получения центральной буквы, найдите длину строки и разделите
# ее пополам. Для создания результирующий строки используйте срез)

# a = input()
# b = len(a)//2
# c = a[b]
# print(c)
# if c == a[0]:
#     print(a[1:-1:])

# a = [1,2,3,4,5,6,7]
# for i in range(6):
#     print(a[i])

